Revit 2027 API
RenderingImageExposureSettings.Highlights Property
 The highlights value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Highlights { get; set; }
Public Property Highlights As Double
	Get
	Set
public:
property double Highlights {
	double get ();
	void set (double value);
}
member Highlights : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The value of highlights is not valid. The valid range is 0 to 1.
Remarks
 Increase this value to get brighter highlights.
See Also
Reference
RenderingImageExposureSettings Class
Autodesk.Revit.DB Namespace